app/views/shops/index4.html.erb

SELECT COUNT(*) FROM `likes` WHERE `likes`.`shop_id` = 1
---
                <i class="far fa-heart LikesIcon-fa-heart"></i>
                <%=t.likes.count%>

SELECT COUNT(*) FROM `likes` WHERE `likes`.`shop_id` = 1
---
                <i class="far fa-heart LikesIcon-fa-heart"></i>
                <%=t.likes.count%>