app/views/shops/show.html.erb

    <% if user_signed_in? %>
    <p>いいね件数: <%= @shop.likes.count %></p>
---
SELECT COUNT(*) FROM `likes` WHERE `likes`.`shop_id` = 1