app/controllers/genres_controller.rb

    def index
        @genres = Genre.all
---
SELECT `genres`.* FROM `genres`

    def create
        @genre = Genre.new(genre_params)
        if @genre.save
---
INSERT INTO `genres` (`name`, `created_at`, `updated_at`) VALUES ('和食・日本料理', '2020-11-21 02:52:23.205814', '2020-11-21 02:52:23.205814')

    def edit
        @genre = Genre.find(params[:id])
---
SELECT `genres`.* FROM `genres` WHERE `genres`.`id` = 1 LIMIT 1

    def update
        @genre = Genre.find(params[:id])
        if @genre.update(genre_params)
---
SELECT `genres`.* FROM `genres` WHERE `genres`.`id` = 1 LIMIT 1
UPDATE `genres` SET `genres`.`name` = '中華', `genres`.`updated_at` = '2020-11-21 02:52:39.021203' WHERE `genres`.`id` = 1