app/controllers/likes_controller.rb

    def create
        @like = current_user.likes.create(shop_id: params[:shop_id])
---
INSERT INTO `likes` (`shop_id`, `user_id`, `created_at`, `updated_at`) VALUES (1, 1, '2020-11-21 03:24:26.607312', '2020-11-21 03:24:26.607312')