app/controllers/prices_controller.rb

SELECT `prices`.* FROM `prices`
---
    def index
        @prices = Price.all

INSERT INTO `prices` (`pricerange`, `created_at`, `updated_at`) VALUES ('～1000円', '2020-11-21 02:54:31.652355', '2020-11-21 02:54:31.652355')
---
    def create
        @price = Price.new(price_params)
        if @price.save