app/controllers/shops_controller.rb

    def top
        @shop_ranks = Shop.find(Like.group(:shop_id).order('count(shop_id) desc').limit(3).pluck(:shop_id))
        @infos = Info.order(created_at: :desc).limit(3)
        @genres = Genre.all
        @prices = Price.all
---
SELECT COUNT(*) FROM `likes` WHERE `likes`.`shop_id` = 1
SELECT `infos`.* FROM `infos` ORDER BY `infos`.`created_at` DESC LIMIT 3
SELECT `genres`.* FROM `genres`
SELECT `prices`.* FROM `prices`

    def top2
        @shop_ranks = Shop.find(Like.group(:shop_id).order('count(shop_id) desc').limit(3).pluck(:shop_id))
        @infos = Info.order(created_at: :desc).limit(3)
        @genres = Genre.all
        @prices = Price.all
---
SELECT COUNT(*) FROM `likes` WHERE `likes`.`shop_id` = 1
SELECT `infos`.* FROM `infos` ORDER BY `infos`.`created_at` DESC LIMIT 3
SELECT `genres`.* FROM `genres`
SELECT `prices`.* FROM `prices`

    def index
        @genres = Genre.all
        @prices = Price.all
        if params[:search] == nil
            if params[:search2] == nil
                @shops = Shop.all
---
SELECT `genres`.* FROM `genres`
SELECT `prices`.* FROM `prices`
SELECT `shops`.* FROM `shops` WHERE (name LIKE '%みやの%' )

    def index3
        @shops = Shop.order("RAND()").limit(params[:num])
        @genres = Genre.all
        @prices = Price.all
---
SELECT `shops`.* FROM `shops` ORDER BY RAND() LIMIT 1
SELECT `genres`.* FROM `genres`
SELECT `prices`.* FROM `prices`

    def index4
        @shops = Shop.where("name LIKE ? ",'%' + params[:search] + '%').or(Shop.where("address LIKE ? ",'%' + params[:search] + '%'))
        @genres = Genre.all
        @prices = Price.all
---
SELECT `shops`.* FROM `shops` WHERE ((name LIKE '%%' ) OR (address LIKE '%%' ))
SELECT `genres`.* FROM `genres`
SELECT `prices`.* FROM `prices`

    def new
        @shop = Shop.new
        @genre = Genre.new
        @genres = Genre.all
        @prices = Price.all
---
SELECT `genres`.* FROM `genres`
SELECT `prices`.* FROM `prices`

    def create
        @shop = Shop.new(shop_params)
        @shop.user_id = current_user.id
        if @shop.save
---
INSERT INTO `shops` (`name`, `phone`, `address`, `rank`, `intro`, `atmos`, `genre_id`, `user_id`, `price_id`, `created_at`, `updated_at`, `image`) VALUES ('みやの2', '042-734-6324', '東京都町田市金井ヶ丘3丁目1-37', 2, 'a', '落ち着いている', 2, 1, 1, '2020-11-21 03:32:01.988536', '2020-11-21 03:32:01.988536', '中華.jpg')

    def show
        @shop = Shop.find(params[:id])
        @like = Like.new
        @genres = Genre.all
        @prices = Price.all
---
SELECT `shops`.* FROM `shops` WHERE `shops`.`id` = 1 LIMIT 1
SELECT `genres`.* FROM `genres`
SELECT `prices`.* FROM `prices`