app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `shops`.* FROM `shops` WHERE `shops`.`id` IN (SELECT `likes`.`shop_id` FROM `likes` WHERE `likes`.`user_id` = 1) LIMIT 3 OFFSET 0
SELECT `genres`.* FROM `genres`
SELECT `prices`.* FROM `prices`
---
    def show
        @user = User.find(params[:id])
        likes = Like.where(user_id: current_user.id).select('shop_id')
        @shops = Shop.where(id: likes).page(params[:page]).per(3)
        @genres = Genre.all
        @prices = Price.all